garyPenhook/PyAvrOCD/svd/avr64ea32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPR</name>
      <description>General Purpose Registers</description>
      <baseAddress>0x0080001C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPR0</name>
          <description>General Purpose Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPR1</name>
          <description>General Purpose Register 1</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPR2</name>
          <description>General Purpose Register 2</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>GPR3</name>
          <description>General Purpose Register 3</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LOCK</name>
      <description>Lockbits</description>
      <baseAddress>0x00801040</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KEY</name>
          <description>Lock Key Bits</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>Lock Key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>No locks</description>
                  <value>1556464988</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWLOCK</name>
                  <description>Read and write lock</description>
                  <value>2738502307</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>NVMCTRL</name>
      <description>Non-volatile Memory Controller</description>
      <baseAddress>0x00801000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADDR</name>
          <description>Address</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16777215</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCMD</name>
                  <description>No Command</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOOP</name>
                  <description>No Operation</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLPW</name>
                  <description>Flash Page Write</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLPERW</name>
                  <description>Flash Page Erase and Write</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLPER</name>
                  <description>Flash Page Erase</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLMPER2</name>
                  <description>Flash 2-page erase enable</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLMPER4</name>
                  <description>Flash 4-page erase enable</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLMPER8</name>
                  <description>Flash 8-page erase enable</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLMPER16</name>
                  <description>Flash 16-page erase enable</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLMPER32</name>
                  <description>Flash 32-page erase enable</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLPBCLR</name>
                  <description>Flash Page Buffer Clear</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPW</name>
                  <description>EEPROM Page Write</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPERW</name>
                  <description>EEPROM Page Erase and Write</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPER</name>
                  <description>EEPROM Page Erase</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEPBCLR</name>
                  <description>EEPROM Page Buffer Clear</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHER</name>
                  <description>Chip Erase Command (UPDI only)</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EECHER</name>
                  <description>EEPROM Erase Command (UPDI only)</description>
                  <value>48</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>APPCODEWP</name>
              <description>Application Code Write Protect</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTRP</name>
              <description>Boot Read Protect</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>APPDATAWP</name>
              <description>Application Data Write Protect</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEWP</name>
              <description>EEPROM Write Protect</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FLMAP</name>
              <description>Flash Mapping in Data space</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECTION0</name>
                  <description>Flash section 0, 0 - 32KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTION1</name>
                  <description>Flash section 1, 32 - 64KB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTION2</name>
                  <description>Flash section 2, 64 - 96KB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECTION3</name>
                  <description>Flash section 3, 96 - 128KB</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLMAPLOCK</name>
              <description>Flash Mapping Lock</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Data</description>
          <addressOffset>0x8</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>INTCTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EEREADY</name>
              <description>EEPROM Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FLREADY</name>
              <description>Flash Ready</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EEREADY</name>
              <description>EEPROM Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FLREADY</name>
              <description>Flash Ready</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EEBUSY</name>
              <description>EEPROM busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FLBUSY</name>
              <description>Flash busy</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ERROR</name>
              <description>Write error</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>No Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITEPROTECT</name>
                  <description>Attempt to program write protected area</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDCOLLISION</name>
                  <description>Selecting new write command while write command already seleted</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRONGSECTION</name>
                  <description>Address cannot be written with selected command</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
